import smtplib
from email.mime.multipart import MIMEMultipart
from email.mime.text import MIMEText

from flask import Flask, render_template, request, jsonify, redirect, url_for

app = Flask(__name__)


def get_icon(consultant):
    icon_map = {
        'קונסטרוקציה': 'building',
        'חשמל': 'bolt',
        'מיזוג': 'fan',
        'בטיחות': 'shield-alt',
        'נגישות': 'wheelchair',
        'פיתוח': 'seedling',
        'יעוץ קרקע וביסוס': 'mountain',
        'כבישים ותנועה': 'road',
        'תשתית': 'network-wired',
        'ניהול תיאום ופיקוח': 'tasks'
    }
    return icon_map.get(consultant, 'cog')


def get_category_image(category):
    image_map = {
        'מבני ציבור': 'public-building.jpg',
        'מבני חינוך': 'education-building.jpg',
        'מבני מגורים': 'residential-building.jpg',
        'מעבדות': 'laboratory.jpg',
        'מרפאות': 'clinic.jpg',
        'מבני משרדים': 'office-building.jpg',
        'מרכזי מלונאות, ספורט ונופש ובריכות שחיה': 'hotel.jpg'
    }
    return image_map.get(category, 'default-project.jpg')


@app.context_processor
def utility_processor():
    return dict(get_icon=get_icon, get_category_image=get_category_image)


@app.route('/', methods=['GET', 'POST'])
def home():
    company_info = {
        'name': 'שחם מערכות מילניום בע"מ',
        'founder': 'יצחק מאירזדה',
        'founded': 'תחילת שנות השמונים',
        'address': 'הערבה 1, גבעת שמואל',
        'phone': '03-6132621',
        'fax': '03-6132619',
        'email': 'Itzhak@shahamm.co.il',
        'description': 'חברה המספקת שירותי תכנון אדריכלי והנדסה מלאים תחת קורת גג אחת.',
        'employees': {
            'architects': 5,
            'consultants': ['קונסטרוקציה', 'חשמל', 'מיזוג', 'בטיחות', 'נגישות', 'פיתוח', 'יעוץ קרקע וביסוס',
                            'כבישים ותנועה', 'תשתית', 'ניהול תיאום ופיקוח']
        },
        'clients': 'עיריות ומועצות מקומיות ואזוריות ברחבי הארץ',
        'projects': [
            'מבני ציבור (מתנ"סים, בתי כנסת, מועדונים)',
            'מבני חינוך (בתי ספר, גנים)',
            'מבני מגורים ומרכזי תעסוקה לילדים ובוגרים אוטיסטים',
            'מועדונים לעמותת אנו"ש לנפגעי נפש',
            'מועדונים ומרכז תעסוקה לויצו',
            'מעבדות ייחודיות לאוניברסיטה ולצה"ל',
            'מרפאות ומבנים ייחודיים למשרד הביטחון, בינוי וחיל אוויר',
            'מבני משרדים לתחנות דלק',
            'מרכזי מלונאות, ספורט ונופש ובריכות שחיה'
        ],
        'detailed_projects': [
            {
                'location': 'מ.מ קדומים',
                'projects': [
                    'תכנון אדריכלי להרחבת בי"ס "נחשון"',
                    'תכנון אדריכלי להקמת מבני תפוס פיס ומועדוני נוער',
                    'תכנון אדריכלי להקמת גן ילדים "הר אפרים"',
                    'תכנון אדריכלי להקמת מרכזי תורני "בני חיל" – חדרי לימוד ומטבח',
                    'תכנון אדריכלי לשיפוץ בתי קשישים וספריות עירוניות',
                    'תכנון אדריכלי להקמת אולמות ספורט ברחבי היישוב',
                    'חידוש ושיפוץ מבני אולפנא',
                    'שיפוצים והרחבות של גני ומעונות ילדים'
                ]
            },
            {
                'location': 'עיריית רמלה',
                'projects': [
                    'תכנון כוללני של בתי ספר, גני ילדים ובתי כנסת',
                    'תכנון בית ספר ברמלה מערב 24 כיתות בשטח של כ-4000 מ"ר',
                    'תכנון בית ספר אבן סינא - 16 כיתות',
                    'תכנון מתנ"ס ובית כנסת בגין',
                    'תכנון אשכול גנים ברמלה מערב',
                    'תכנון בית ספר אריאל - תוספת אגף למבנה קיים, סה"כ שטח 600 מ"ר',
                    'תכנון בית ספר "טללי חיים" - שטח 800 מ"ר',
                    'שלושה אשכולות גנים - שטח של סה"כ 1500 מ"ר',
                    'תכנון מועדון קהילתי "אקים" - תוספת אגף בשטח 450 מ"ר',
                    'תכנון בית ספר טכנולוגי "דרור" - שטח 800 מ"ר',
                    'אשכול גני ילדים ע"ש עופרה חזה - שטח 500 מ"ר + 800 מ"ר עבור בית כנסת; סה"כ שטח 1300 מ"ר'
                ]
            },
            {
                'location': 'בית"ר עלית',
                'projects': [
                    'תכנון אדריכלי בבתי ספר, גני ילדים ומרכזי תרבות כדוגמת בית ספר ממ"ד 27 כיתות בשטח 2600 מ"ר',
                    'תכנון אדריכלי למבנה רב תכליתי בקריית החינוך הכולל: בית מדרש בשטח 1200 מ"ר, אשכול גני ילדים בשטח 800 מ"ר, בית כנסת דו קומתי בשטח 800 מ"ר'
                ]
            }
        ],
        'other_projects': [
            {'location': 'מעלה החמישה', 'project': 'תכנון כולל להקמת בית מלון, אולמות קונגרסים וספא',
             'budget': '72,000,000 ₪'},
            {'location': 'קרית עקרון', 'project': 'תכנון אדריכלי למרכז תעסוקה, משרדים, מרכז מסחרי ותחנת דלק',
             'budget': '20,000,000 ₪'},
            {'location': 'כרמיאל', 'project': 'תכנון אדריכלי למבנה מסחרי ותעשייה', 'budget': '16,000,000 ₪'},
            {'location': 'ויצ"ו ירושלים', 'project': 'תכנון אדריכלי של מתנ"ס "כגן"', 'budget': '6,500,000 ₪'},
            {'location': 'אלו"ט חולון', 'project': 'תכנון אדריכלי של הוסטל לאוטיסטיים', 'budget': '7,000,000 ₪'},
            {'location': 'אלו"ט ראשל"צ', 'project': 'תכנון אדריכלי של הוסטל לילדים אוטיסטיים', 'budget': '7,000,000 ₪'},
            {'location': 'אלו"ט ירושלים', 'project': 'תכנון אדריכלי של הוסטל לילדים אוטיסטיים',
             'budget': '7,500,000 ₪'},
            {'location': 'אלו"ט כרמיאל', 'project': 'תכנון אדריכלי של הוסטל לילדים אוטיסטיים', 'budget': '7,000,000 ₪'}
        ],
        'kibbutzim': [
            'חצרים', 'סעד', 'סופה', 'חולית', 'בית גוברין', 'מעלה החמישה', 'ניר עציון', 'עין הבשור',
            'שדה משה', 'גבעת יערים', 'אלישמע', 'רינתיה', 'מזור', 'בני עטורת', 'סגולה', 'כפר הריף',
            'גן דרום', 'תימורים', 'שדה יואב', 'קבוצת שילר', 'ניר יצחק', 'משואות יצחק'
        ],
        'kibbutz_projects': [
            'תכנון מבני ציבור ומבני משק ותעשיה', 'תכנון תשתיות, כבישים ותנועה',
            'ניהול ופיקוח על ביצוע בניית מבני ציבור, שכונות מגורים, תשתיות מים וביוב ופיתוח כבישים',
            'מכוני חליבה, רפתות, לולים, מגרשי ספורט, אולמות ספורט, מקלטים, מרפאות, חדרי אוכל ומטבח, מפעלים, בריכות שחיה',
            'מבני מנהלה, הרחבות היישובים'
        ]
    }

    if request.method == 'POST':
        # כאשר הטופס נשלח, פשוט מעבירים את המשתמש לדף התודה
        return redirect(url_for('thank_you'))

    return render_template('home.html', company=company_info)

@app.route('/thank_you')
def thank_you():
    return render_template('thank_you.html')


if __name__ == '__main__':
    app.run(debug=True)
